 export const initialCourses = [
    { id: 1, name: "آموزش Tailwind CSS", teacher: "دکتر محمدحسین بحرالعلومی", price: "۵۰,۰۰۰", date: "۱۴۰۳/۰۳/۱۸", status: "در انتظار تایید", icon: "⚛️" },
    { id: 2, name: "آموزش کامل کار با Figma", teacher: "دکتر محمدحسین بحرالعلومی", price: "۵۰,۰۰۰", date: "۱۴۰۳/۰۳/۱۸", status: "در انتظار تایید", icon: "🎨" },
    { id: 3, name: "آموزش Next.js و Full Stack", teacher: "محمد رضا ساداتی", price: "۲,۵۰,۰0۰", date: "۱۴۰۳/۰۳/۰۱", status: "تایید شده", icon: "🚀" },
    { id: 4, name: "آموزش Front-End پیشرفته", teacher: "دکتر محمدحسین بحرالعلومی", price: "۲,۵۰,۰0۰", date: "۱۴۰۳/۰۲/۲۵", status: "در انتظار تایید", icon: "💻" },
    { id: 5, name: "مقدمات هوش مصنوعی", teacher: "علی رضایی", price: "۸۰,۰۰۰", date: "۱۴۰۳/۰۴/۰۵", status: "تایید شده", icon: "🤖" },
    { id: 6, name: "یادگیری SQL و PostgreSQL", teacher: "ندا کریمی", price: "۱,۵۰,۰0۰", date: "۱۴۰۳/۰۱/۱۰", status: "تایید شده", icon: "💾" },
    { id: 7, name: "طراحی UI/UX با Sketch", teacher: "هادی احمدی", price: "۶۰,۰۰۰", date: "۱۴۰۳/۰۵/۰۱", status: "در انتظار تایید", icon: "📐" },
    { id: 8, name: "آموزش React Hooks", teacher: "دکتر محمدحسین بحرالعلومی", price: "۹۰,۰۰۰", date: "۱۴۰۳/۰۵/۱۰", status: "تایید شده", icon: "💡" },
  ];
  
  const COURSES_PER_PAGE = 5; 
  
  const STATUS_OPTIONS = [
      { key: 'All', label: 'همه دوره‌ها', statuses: ['تایید شده', 'در انتظار تایید'] },
      { key: 'ApprovedOnly', label: 'فقط تایید شده', statuses: ['تایید شده'] },
      { key: 'PendingOnly', label: 'فقط در انتظار تایید', statuses: ['در انتظار تایید'] },
  ];
  